; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v3 ?v10)
             (pred_12 ?v2 ?v5)
             (pred_8 ?v3 ?v5)
             (pred_4 ?v1 ?v3 )
	     (pred_5 ?v3)
             (pred_7 ?v11)
             (pred_1 ?v2)
             (pred_11 ?v5)
             (pred_9 ?v3)
             (pred_2 ?v2)
             (pred_10 ?v3)
             (pred_6 ))



(:action op_3
:parameters (?v8 ?v12 ?v4 ?v13)
:precondition (and (pred_7 ?v8) (pred_7 ?v12) (pred_1 ?v4) (pred_11 ?v13)
          (pred_3 ?v8 ?v12) (pred_12 ?v4 ?v13)
                   (pred_8 ?v12 ?v13) (pred_5 ?v8) 
                   (pred_9 ?v12) (pred_2 ?v4))
:effect (and  (pred_10 ?v12) (not (pred_9 ?v12))))


(:action op_2
:parameters (?v8 ?v9)
:precondition (and (pred_7 ?v8) (pred_7 ?v9)
               (pred_5 ?v8) (pred_3 ?v8 ?v9) (pred_10 ?v9))
:effect (and (pred_5 ?v9) (not (pred_5 ?v8))))

(:action op_5
:parameters (?v8 ?v4)
:precondition (and (pred_7 ?v8) (pred_1 ?v4) 
                  (pred_5 ?v8) (pred_4 ?v4 ?v8) (pred_6 ))
:effect (and (pred_2 ?v4)
   (not (pred_4 ?v4 ?v8)) (not (pred_6 ))))


(:action op_1
:parameters (?v8 ?v7 ?v6)
:precondition (and (pred_7 ?v8) (pred_1 ?v7) (pred_1 ?v6)
                  (pred_5 ?v8) (pred_2 ?v6) (pred_4 ?v7 ?v8))
:effect (and (pred_2 ?v7) (pred_4 ?v6 ?v8)
        (not (pred_2 ?v6)) (not (pred_4 ?v7 ?v8))))

(:action op_4
:parameters (?v8 ?v4)
:precondition (and (pred_7 ?v8) (pred_1 ?v4) 
                  (pred_5 ?v8) (pred_2 ?v4))
:effect (and (pred_6 ) (pred_4 ?v4 ?v8) (not (pred_2 ?v4)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_04 obj_32 obj_13 obj_10 obj_27 obj_11 obj_31 obj_30 obj_08 obj_15 obj_25 obj_01 obj_20 obj_09 obj_23 obj_07 obj_17 obj_22 obj_14 obj_18 obj_21 obj_24 obj_06 obj_28 obj_12
    obj_05 obj_02 obj_19
    obj_29 obj_03 obj_26 obj_16
    )

    (:init
       (pred_6)

       (pred_7 obj_04)
       (pred_7 obj_32)
       (pred_7 obj_13)
       (pred_7 obj_10)
       (pred_7 obj_27)
       (pred_7 obj_11)
       (pred_7 obj_31)
       (pred_7 obj_30)
       (pred_7 obj_08)
       (pred_7 obj_15)
       (pred_7 obj_25)
       (pred_7 obj_01)
       (pred_7 obj_20)
       (pred_7 obj_09)
       (pred_7 obj_23)
       (pred_7 obj_07)
       (pred_7 obj_17)
       (pred_7 obj_22)
       (pred_7 obj_14)
       (pred_7 obj_18)
       (pred_7 obj_21)
       (pred_7 obj_24)
       (pred_7 obj_06)
       (pred_7 obj_28)
       (pred_7 obj_12)
       (pred_11 obj_05)
       (pred_11 obj_02)
       (pred_11 obj_19)
       (pred_1 obj_29)
       (pred_1 obj_03)
       (pred_1 obj_26)
       (pred_1 obj_16)

       (pred_3 obj_04 obj_11)
       (pred_3 obj_04 obj_32)
       (pred_3 obj_32 obj_31)
       (pred_3 obj_32 obj_13)
       (pred_3 obj_32 obj_04)
       (pred_3 obj_13 obj_30)
       (pred_3 obj_13 obj_10)
       (pred_3 obj_13 obj_32)
       (pred_3 obj_10 obj_08)
       (pred_3 obj_10 obj_27)
       (pred_3 obj_10 obj_13)
       (pred_3 obj_27 obj_15)
       (pred_3 obj_27 obj_10)
       (pred_3 obj_11 obj_25)
       (pred_3 obj_11 obj_31)
       (pred_3 obj_11 obj_04)
       (pred_3 obj_31 obj_01)
       (pred_3 obj_31 obj_30)
       (pred_3 obj_31 obj_32)
       (pred_3 obj_31 obj_11)
       (pred_3 obj_30 obj_20)
       (pred_3 obj_30 obj_08)
       (pred_3 obj_30 obj_13)
       (pred_3 obj_30 obj_31)
       (pred_3 obj_08 obj_09)
       (pred_3 obj_08 obj_15)
       (pred_3 obj_08 obj_10)
       (pred_3 obj_08 obj_30)
       (pred_3 obj_15 obj_23)
       (pred_3 obj_15 obj_27)
       (pred_3 obj_15 obj_08)
       (pred_3 obj_25 obj_07)
       (pred_3 obj_25 obj_01)
       (pred_3 obj_25 obj_11)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_01 obj_20)
       (pred_3 obj_01 obj_31)
       (pred_3 obj_01 obj_25)
       (pred_3 obj_20 obj_22)
       (pred_3 obj_20 obj_09)
       (pred_3 obj_20 obj_30)
       (pred_3 obj_20 obj_01)
       (pred_3 obj_09 obj_14)
       (pred_3 obj_09 obj_23)
       (pred_3 obj_09 obj_08)
       (pred_3 obj_09 obj_20)
       (pred_3 obj_23 obj_18)
       (pred_3 obj_23 obj_15)
       (pred_3 obj_23 obj_09)
       (pred_3 obj_07 obj_21)
       (pred_3 obj_07 obj_17)
       (pred_3 obj_07 obj_25)
       (pred_3 obj_17 obj_24)
       (pred_3 obj_17 obj_22)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_17 obj_07)
       (pred_3 obj_22 obj_06)
       (pred_3 obj_22 obj_14)
       (pred_3 obj_22 obj_20)
       (pred_3 obj_22 obj_17)
       (pred_3 obj_14 obj_28)
       (pred_3 obj_14 obj_18)
       (pred_3 obj_14 obj_09)
       (pred_3 obj_14 obj_22)
       (pred_3 obj_18 obj_12)
       (pred_3 obj_18 obj_23)
       (pred_3 obj_18 obj_14)
       (pred_3 obj_21 obj_24)
       (pred_3 obj_21 obj_07)
       (pred_3 obj_24 obj_06)
       (pred_3 obj_24 obj_17)
       (pred_3 obj_24 obj_21)
       (pred_3 obj_06 obj_28)
       (pred_3 obj_06 obj_22)
       (pred_3 obj_06 obj_24)
       (pred_3 obj_28 obj_12)
       (pred_3 obj_28 obj_14)
       (pred_3 obj_28 obj_06)
       (pred_3 obj_12 obj_18)
       (pred_3 obj_12 obj_28)
       (pred_9 obj_31)
       (pred_9 obj_14)
       (pred_9 obj_32)
       (pred_9 obj_06)
       (pred_8  obj_31 obj_05)
       (pred_8  obj_14 obj_02)
       (pred_8  obj_32 obj_19)
       (pred_8  obj_06 obj_19)
       (pred_10 obj_04)
       (pred_10 obj_13)
       (pred_10 obj_10)
       (pred_10 obj_27)
       (pred_10 obj_11)
       (pred_10 obj_30)
       (pred_10 obj_08)
       (pred_10 obj_15)
       (pred_10 obj_25)
       (pred_10 obj_01)
       (pred_10 obj_20)
       (pred_10 obj_09)
       (pred_10 obj_23)
       (pred_10 obj_07)
       (pred_10 obj_17)
       (pred_10 obj_22)
       (pred_10 obj_18)
       (pred_10 obj_21)
       (pred_10 obj_24)
       (pred_10 obj_28)
       (pred_10 obj_12)

       (pred_12  obj_29 obj_05)
       (pred_12  obj_03 obj_02)
       (pred_12  obj_26 obj_19)
       (pred_12  obj_16 obj_02)
       (pred_4 obj_29 obj_28)
       (pred_4 obj_03 obj_30)
       (pred_4 obj_26 obj_24)
       (pred_4 obj_16 obj_25)
       (pred_5 obj_01)
    )

    (:goal (and
       (pred_4 obj_29 obj_12)
       (pred_4 obj_03 obj_28)
       (pred_4 obj_26 obj_18)
       (pred_4 obj_16 obj_04)
    ))
(:constraints
  (always (not (pred_5 obj_06)))
)
)

; plan
1. (op_2 obj_01 obj_25)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_25)
   goals met: 0 of 4
2. (op_5 obj_25 obj_16)
   deleted: (pred_4 obj_16 obj_25) (pred_6)
   added: (pred_2 obj_16)
   goals met: 0 of 4
3. (op_2 obj_25 obj_11)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_11)
   goals met: 0 of 4
4. (op_2 obj_11 obj_04)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_04)
   goals met: 0 of 4
5. (op_4 obj_04 obj_16)
   deleted: (pred_2 obj_16)
   added: (pred_6) (pred_4 obj_16 obj_04)
   goals met: 1 of 4
6. (op_2 obj_04 obj_11)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_11)
   goals met: 1 of 4
7. (op_2 obj_11 obj_25)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_25)
   goals met: 1 of 4
8. (op_2 obj_25 obj_01)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_01)
   goals met: 1 of 4
9. (op_2 obj_01 obj_17)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_17)
   goals met: 1 of 4
10. (op_2 obj_17 obj_24)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_24)
   goals met: 1 of 4
11. (op_5 obj_24 obj_26)
   deleted: (pred_4 obj_26 obj_24) (pred_6)
   added: (pred_2 obj_26)
   goals met: 1 of 4
12. (op_3 obj_24 obj_06 obj_26 obj_19)
   deleted: (pred_9 obj_06)
   added: (pred_10 obj_06)
   goals met: 1 of 4
13. (op_2 obj_24 obj_17)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_17)
   goals met: 1 of 4
14. (op_2 obj_17 obj_22)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_22)
   goals met: 1 of 4
15. (op_2 obj_22 obj_20)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_20)
   goals met: 1 of 4
16. (op_2 obj_20 obj_30)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_30)
   goals met: 1 of 4
17. (op_1 obj_30 obj_03 obj_26)
   deleted: (pred_2 obj_26) (pred_4 obj_03 obj_30)
   added: (pred_2 obj_03) (pred_4 obj_26 obj_30)
   goals met: 1 of 4
18. (op_2 obj_30 obj_20)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_20)
   goals met: 1 of 4
19. (op_2 obj_20 obj_22)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_22)
   goals met: 1 of 4
20. (op_3 obj_22 obj_14 obj_03 obj_02)
   deleted: (pred_9 obj_14)
   added: (pred_10 obj_14)
   goals met: 1 of 4
21. (op_2 obj_22 obj_14)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_14)
   goals met: 1 of 4
22. (op_2 obj_14 obj_28)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_28)
   goals met: 1 of 4
23. (op_1 obj_28 obj_29 obj_03)
   deleted: (pred_2 obj_03) (pred_4 obj_29 obj_28)
   added: (pred_2 obj_29) (pred_4 obj_03 obj_28)
   goals met: 2 of 4
24. (op_2 obj_28 obj_12)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_12)
   goals met: 2 of 4
25. (op_4 obj_12 obj_29)
   deleted: (pred_2 obj_29)
   added: (pred_6) (pred_4 obj_29 obj_12)
   goals met: 3 of 4
26. (op_2 obj_12 obj_18)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_18)
   goals met: 3 of 4
27. (op_2 obj_18 obj_23)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_23)
   goals met: 3 of 4
28. (op_2 obj_23 obj_15)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_15)
   goals met: 3 of 4
29. (op_2 obj_15 obj_08)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_08)
   goals met: 3 of 4
30. (op_2 obj_08 obj_30)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_30)
   goals met: 3 of 4
31. (op_5 obj_30 obj_26)
   deleted: (pred_4 obj_26 obj_30) (pred_6)
   added: (pred_2 obj_26)
   goals met: 3 of 4
32. (op_2 obj_30 obj_08)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_08)
   goals met: 3 of 4
33. (op_2 obj_08 obj_15)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_15)
   goals met: 3 of 4
34. (op_2 obj_15 obj_23)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_23)
   goals met: 3 of 4
35. (op_2 obj_23 obj_18)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_18)
   goals met: 3 of 4
36. (op_4 obj_18 obj_26)
   deleted: (pred_2 obj_26)
   added: (pred_6) (pred_4 obj_26 obj_18)
   goals met: 4 of 4
